[
  {
    "id": "qdDeKVnYmyF8axYoYJnU9",
    "review": "PngImage4D3CB166480-review-ae16dbc0-ca2c-4deb-b0a9-90c68a0b2f1d",
    "alttext": "Chasing Shadows • Just started it... The story of Citizen Lab, the world's foremost digital watchdog. Encouraging and depressing all at once. • Liked It"
  },
  {
    "id": "uWnRpiPYkXpV12poXYqaR",
    "review": "PngImage43919Ad5A30-review-a6d1efbe-5de8-4a8b-8875-796aff0ada0f",
    "alttext": "Dark Wire • Joseph Cox • Joseph Cox is a great security beat journalist, and this story is wild enough already. Sometimes I think the FBI just does stuff because they can and can secretly have fun doing it. • Loved It!"
  },
  {
    "id": "nOM6DIBNoT2zW1NadhQcs",
    "review": "PngImage4F579D31240-review-7451bed2-59af-4d84-9a7c-66aee2e710cc",
    "alttext": "The Ministry for the Future • Kim Stanley Robinson • I enjoyed this book when I read it, because they captured the climate change disaster headed our way. What they didn't foresee, however, is just how insane governments all over the world would go before we even get that far. Not dystopian enough after all. • Liked It"
  },
  {
    "id": "83G4wY0SFJL-Be8z6EOw9",
    "review": "PngImage4A79B0E5E30-review-f9e93501-df54-4be4-a46e-908f7c5af5e5",
    "alttext": "REAMDE • Neal Stephenson • Probably not regarded as a Stephenson classic, but honestly I think it's one of his better stories. Fewer sidetracks, more approachable. • Loved It!"
  },
  {
    "id": "xrDTtTpJbGMh9PgCHNdPJ",
    "review": "Silo-Series-Collection-review-3ABD1A95-A382-4EB0-AD9E-B5253755A6BD",
    "alttext": "The Silo Series Collection • One of the best dystopian series ever written. Kind of hard to read in early 2025 though. • Loved It!"
  },
  {
    "id": "7ri4WvmlMLq7yUEbDAWVf",
    "review": "PngImage4D3F935C6C0-review-591b3665-f084-4cf9-9881-f5c78d33aea5",
    "alttext": "Snow Crash • Neal Stephenson • 1992  • This has to be one of the classic cyberpunk novels. It's dumb AND cool, silly AND serious. It's also a fascinating look at how language controls thought and vice-versa. • Loved It!"
  },
  {
    "id": "kEgH9Q0ZFqPONIzwwlc9U",
    "review": "PngImage4Bb4B153Ff0-review-3a9aa495-7f1a-4e22-958c-8d35ad1090d5",
    "alttext": "Tracers in the Dark • Andy Greenberg • Truly anonymous finance is the wet dream of the libertarian crypto bros, but it's a lie. Turns out logging everything is actually just like logging everything. Tons of wild and wacky fun. • Loved It!"
  },
  {
    "id": "KQVam9p4EJYbrEPzm8yLc",
    "review": "PngImage4Aba9906800-review-7e9014cc-0d42-490d-9831-e397bfaf25cf",
    "alttext": "The Vanished Birds • 2020 • Simon Jiminez • A very unique sci-fi and somewhat haunting story of individualism, loyalty, corruption, and the greed of corporate power. • Loved It!"
  },
  {
    "id": "d9WqUYW7agQPVUIZ2FIUo",
    "review": "PngImage42D385B1Ec0-review-bfa78cd8-2d6b-4aed-910e-c70730dfeb40",
    "alttext": "Revolution in the Valley • Andy Hertzfeld • 2004 • Andy Hertzfeld brings a collection of stories together into this wonderful look at how the Mac was born, with a unique sense of fun and excitement. • Loved It!"
  },
  {
    "id": "V3-i-pxTdqpGippacUhIq",
    "review": "PngImage48F9Bb6BC60-review-7418f38b-a328-4675-839f-ec785545a66a",
    "alttext": "Hackers: Heroes of the Compum • Steven Levy • 1984 • Anyone who lived and breathed computers sometime during the periods covered in Hackers will enjoy it greatly. For me, the book is more than the sum of its pages because it covers a time I remember well. • Loved It!"
  },
  {
    "id": "xBYCe4Yw14oKFSVcddg3t",
    "review": "PngImage4D4285D3C30-review-41d0727f-9c82-467e-adff-9af6ae7868ca",
    "alttext": "First Into Nagasaki • George Weller • 2006 • It's hard to read any history of war and not become sad and depressed about how we are capable of treating our fellow humans. First into Nagasaki is brutal, fascinating and engrossing, with details that paint a vivid picture of what the war was like. • Loved It!"
  },
  {
    "id": "0PW4SPA4ny-rGTGhUBGyZ",
    "review": "PngImage43Fd94F5520-review-e4422e21-336e-4edb-8020-36c2c0d70750",
    "alttext": "Pattern Recognition • William Gibson • 2005 • Relatable on so many levels. Probably Gibson's finest from a character standpoint. Beautifully, beautifully written. • Loved It!"
  },
  {
    "id": "aichrWKrTHDLWyHv_PSSH",
    "review": "PngImage40E1B6080F0-review-d7f20215-0589-4fab-b9c2-fb53db5032eb",
    "alttext": "Out of the Inner Circle: A Hacker's Guide to Computer Security • Bill Landreth • 1985 • This book was great at the time. It's useful for seeing the origins of computer hacking (or cracking). Sadly, Bill later struggled with mental illness and homelessness. • Liked It"
  },
  {
    "id": "Qdq5nrHAOKZ6Gg8jY37Ju",
    "review": "PngImage409A88Fc370-review-613e7148-4e48-4990-a926-e6c9246a17f0",
    "alttext": "The Friendly Orange Glow • 2017 • Brian Dear • It's no secret I love computer history stories, and this really captures the era it covers. A must read. • Loved It!"
  },
  {
    "id": "gCPpkBmxjhnVev6GeAKTe",
    "review": "PngImage47999Ba1670-review-27cd7e05-ce1c-4e71-897d-f63b63567a45",
    "alttext": "Changer • 2016 • Matt Gemmell • Outstanding for a first novel, and really fun in general. Although I had some questions about anti-tachyons and force-duels on chapel rooftops, l liked the characters and it's obvious the author does too. That's rare in books, honestly. • Loved It!"
  },
  {
    "id": "XHF6R55tEcmajkVdTk-C7",
    "review": "PngImage4C3A8D714C0-review-136eea48-1079-4aae-8fc4-b0dfb4a639c8",
    "alttext": "Coders: The Making of a New Tribe and the Remaking of the World • 2019 • Clive Thompson • A fun computer history book that does look at fun aspects of programming, but also the sexism and other issues that pervade the culture. Naturally, these references make some people angry, but those are not good people. • Loved It!"
  },
  {
    "id": "CaJjEWCTvJsDA_LeF9Tib",
    "review": "PngImage4Aef934F5C0-review-7b509bdf-238d-4d30-9ba3-196eab668159",
    "alttext": "Virtual Light • 1993 • William Gibson • A very good book, imaginative and hopefully not prophetic. The first of a series that works together better as the sum of its parts, but individually, this one is a good read. • Liked It"
  },
  {
    "id": "fb14fgZXbchTVN2UBJjzW",
    "review": "PngImage46EdA39F3E0-review-f1cfc701-447f-4c14-a881-14ec202d6037",
    "alttext": "The Diamond Age or a Young Lady's Illustrated Primer • 1995 • Neal Stephenson • Unique and engaging world-building, wonderful protagonist in Nell, and thought- provoking mix of Chinese and English Victorian cultures as the dominant societies of the future. Very original picture of the future. • Loved It!"
  },
  {
    "id": "5NUbuONvO5fkc_20PpSbr",
    "review": "PngImage4518B702990-review-ed017107-0b31-4c80-98da-299d76cd6d5b",
    "alttext": "Sleeping Giants • 2016 • Sylvain Neuvel • Mech stories are nothing new, but this is a fun twist on the genre. Would read again. • Loved It!"
  },
  {
    "id": "ZpHntzaCV4WoLX7xVx80S",
    "review": "PngImage48B8Ae28380-review-a6b05ade-e959-4ed2-b91f-c3deb81a0083",
    "alttext": "American Gods • 2001 • Neil Gaiman • I tried to like it. But I can't. I don't. I won't. Also, I never understood the appeal of Neil Gaiman, and now we all know why. Suspicions confirmed. • Didn't Like It"
  },
  {
    "id": "LWVhEaf0AvFnhK_y0Nyfp",
    "review": "PngImage41E4B629990-review-1b52ba5b-0e81-465a-8108-7ea9c658e820",
    "alttext": "Fall; or, Dodge in Hell • 2019 • Neal Stephenson When I first started reading this and Neal veered off into the mythology of the upload world, I thought \"this is NOT for me\". But I kept reading, and truthfully I was wrong. It was for me. I actually really like this book and appreciate what Neal is doing here. Don't sleep on it. • Loved It!"
  },
  {
    "id": "Uu85bsWWtgO75HjGXXgR7",
    "review": "PngImage4404867CE10-review-f34e816c-73c2-4224-8d9a-8ac1e93b25ce",
    "alttext": "Infomocracy • 2016 • Malka Ann Older I liked this book - but I didn't love it. I think it downplays the chaos involved in the kinds of social change Malka is depicting. Nonetheless, it's a super original look at future alternate social and political structures, and for that it's certainly worth a read. • Liked It"
  },
  {
    "id": "vwe-ooGR_nW7Nr4E2StwN",
    "review": "PngImage47A2B3C4130-review-162cdfbc-d340-49ac-92f1-87fefb4afb8a",
    "alttext": "The Circle • 2013 • Dave Eggers I found this book very clumsily written. It could have been a very skillful skewering of the worst of tech. Instead, it made me find it all completely unrealistic and therefore useless as relevant commentary. • Didn't Like It"
  },
  {
    "id": "wBHbzsKZdWoVk-ACsotIT",
    "review": "PngImage447C8168150-review-2d617e4e-0e07-4fe1-9145-de1376f3caa2",
    "alttext": "Doomsday Book • 1992 • Connie Willis A time traveler from the near future goes back to England of the 14th century and stumbles into the Black Death wiping everyone out all around her. Sounds horrible - and yet, it's a wonderful book. There are compelling characters in the future and in the past, and it's somehow compelling even while being a horrific portrayal of the plague. • Loved It!"
  },
  {
    "id": "iLVU3Iqj_Pac4DGkHgj_k",
    "review": "PngImage478AB806140-review-c6ab51ae-7a02-4f74-b2df-dc93d7044ffe",
    "alttext": "When the Moon Hits Your Eye • 2025 • John Scalzi This is what should be called a silly, maybe even dumb, book. But it isn't. It's fun. And it manages to make a few relevant points about humanity along the way. • Loved It!"
  },
  {
    "id": "W7n_a9uj04bq7ESZxpXiI",
    "review": "PngImage46E8Bc34D10-review-522d036e-737a-4984-b24e-5e2f3f730b24",
    "alttext": "Dope Thief • 2009 • Dennis Tafoya • Not quite the impact of the tv series for me, but quite good nonetheless. If you've watched the TV series and liked it, you can probably skip the book unless you really want to see what the differences in the original story were. • Liked It"
  },
  {
    "id": "KswExwsH8dvrMln9y9r8C",
    "review": "PngImage401AA8309E0-review-bc3112ea-cb01-4386-88c0-61195a185576",
    "alttext": "Apple in China • 2025 • Patrick McGee • Detailed, interesting, and informative. It lays out how much Apple contributed to China's tech manufacturing dominance, and the existential challenges it has to navigate. • Loved It!"
  },
  {
    "id": "1VMW9hculSIHa7oHEcLbp",
    "review": "PngImage498A9F6D680-review-9e725bb8-827b-4445-9e2c-5b07a9cad227",
    "alttext": "Sir Lewis • 2025 • Michael Sawyer Look. Lewis is an actual role model, and he's also a true legend. This book was just a little too willing to bypass nuances in a couple cases and overstate its case. It did not need to do that, because Lewis' life and work speaks for itself. • Liked It"
  },
  {
    "id": "VHhkaIhKKzGkNUzSqGpgz",
    "review": "png-image43aeb2d0160-review-c7853685-8e59-44d3-a5c3-8972cd1ce8ca",
    "alttext": "Things Become Other Things • 2025 • Craig Mod Craig is a fascinating guy, not least because of the fact he's ingrained himself into the culture of Japan, a country I grew up in, but because he's an artful storyteller and photographer. In this book, he brings the reader along on one of his long walks through the Japan countryside as he ties the pieces of his past together with his present in a way that few people can. • Loved It!"
  },
  {
    "id": "ib7ajbyZnq9ygr6N7lTSC",
    "review": "png-image4537a0c7710-review-48d5430a-a2f5-4bb7-9a50-e43faa10c2ec",
    "alttext": "Empire of AI • 2025 • Karen Hao • An important look at the narratives society is being sold about AI and the people selling those narratives. • Loved It!"
  },
  {
    "id": "vsRrvtMOTP9daw_ViJN6-",
    "review": "png-image4ebabaea1b0-review-954dbef9-86ea-478b-a0dd-e2bc85854b6a",
    "alttext": "To Say Nothing of the Dog • 2013 • Connie Willis • Book 3 of the Oxford Time Travel series. It's funny and cute and compelling, even if I miss Mr. Dunworthy's constant presence ala Doomsday Book. But Ned Henry and all the other characters make this a fun book that's hard to put down. • Loved It!"
  },
  {
    "id": "cnCDyQXxg_eGt8zLBfJOW",
    "review": "png-image492cb8af700-review-a142100d-fff7-45c3-9a2c-cbf1609682df",
    "alttext": "A History of What Comes Next • M Sylvain Neuvel • 2021 • A wonderful historical fiction novel that becomes... sci-fi? Yes, and it's a great premise too. It's not always an easy read, because there is a lot of tension and bad times, but it IS a worthy read. • Loved It!"
  },
  {
    "id": "lEKSzkOlJZzu_S4HJU_tK",
    "review": "png-image447c967d8c0-review-c3a0b328-23e4-4f0e-bdf2-c3320ace2a6f",
    "alttext": "First Contact • 2025 • Becky Ferreira • A delightful look at the science, superstitions, stories, and suppositions behind the search for alien life throughout history. • Loved It!"
  },
  {
    "id": "pzW8bOdMzBN2iyexXjF9h",
    "review": "png-image4fe5bf59280-review-07d00041-80c5-40df-96f4-1e73860e4edd",
    "alttext": "Buried in the Sky • 2012 • Climbers are nuts. People keep dying on these peaks in really unnecessary ways and it very often seems like the result of the most idiotic decisions on the part of people who are supposed to be experienced. Really gripping tale. • Loved It!"
  },
  {
    "id": "iSwBczUdkI81jixvOfJW3",
    "review": "png-image4d91820dd30-review-b2bea251-8101-4aa6-bca0-e80db51fcbc2",
    "alttext": "We Don't Need Roads • Caseen Gaines • 2015 • Amateurishly and inelegantly written to the point where I'm not sure how reliable the narratives are. Don't read it, even if you love Back to the Future. • Didn't Like It"
  },
  {
    "id": "72iEZNf_SrXQwNTgp_Cn1",
    "review": "png-image4dd09994160-review-c50952a1-62fd-4f67-a41d-85082a7e6f69",
    "alttext": "Grid to Glory • 2025 • Alex Jacques • Alex Jacques is one of my favorite F1 commentators. His personality shines, and he's clearly a hard worker who knows what he's doing. The stories he's chosen for this book are compelling, but the writing style pulls me out of them. He uses sentence fragments instead of commas, and sometimes the background explanations are slightly muddled. Good, not great. • Decent"
  },
  {
    "id": "Eit-ECiMRBoFBK-lKnZtr",
    "review": "png-image458cbadfd70-review-68981979-9b1f-4d9e-9ae9-1c29c838e7c5",
    "alttext": "The Convenience Store by the Sea • First Time Read • 2020 • Sonoko Machida • I didn't know what to think of this book initially. It felt slightly stilted, whether due to translation or not, I'm not sure. But I kept reading. And it started drawing me in by brilliantly building intertwined moments of social interactions and vignettes of character development. • Loved It!"
  },
  {
    "id": "gqO3Encr2YUNCkegsfZ6E",
    "review": "png-image477b8a8df50-review-085d7f25-50b9-400e-a578-287471d5d87e",
    "alttext": "The Best Science Fiction and Fantasy of the Year Volume 2 • Jonathan Strahan • Mar 1, 2008 • This is a really good and varied compilation of stories. The thing these books do well is introduce you to stories and authors you wouldn't have found yourself, and that are certainly interesting and thought-proving. *****"
  }
]
