[
  {
    "id": "lB-gweEeH8Djq60csWGX-",
    "review": "PngImage454BBeceCf0-review-ec28f74f-944a-481b-8c4c-3fd78be89229",
    "alttext": "Magic Monkey • Godiego • 1980 • A childhood favorite from when I lived in Kagoshima, Japan. Apparently Apple Music has heard of Godiego, so hey! Good work, Apple! • Loved It!"
  },
  {
    "id": "jYgriDr8SLKvV7x8AXJ_u",
    "review": "PngImage446EB7Aa4F0-review-573431f0-ca97-4e5e-a380-c905768f7ac2",
    "alttext": "Dive • Artist: Almost Monday • I heard \"Can't Slow Down\" in a 7-Eleven, that's literally how I discovered this album and band Not my usual, but good! • Liked It"
  },
  {
    "id": "OB3DBnc9DgAMYTpbE-6le",
    "review": "PngImage464D985BA90-review-64698752-ce97-4b6d-b563-e8276af363ea",
    "alttext": "Affection • 2020 • Bugseed I don't know how I ran across Bugseed. I have zero memory of it. All I know is, this is wonderful lo-fi funk, perfect for programming, zoning out, or just forgetting the hellscape that is 2025. Can recommend. • Liked It"
  },
  {
    "id": "y_5vuzGrhZNoQFIzmxh3F",
    "review": "PngImage45F6A235Ec0-review-7284f251-423f-4f2a-9a59-deaa781a7465",
    "alttext": "Passive Aggressive Robot - Single • 2022 • Rinzen A two song single release that is great for inclusion in a workout mix or just anytime you want to hear electronic or dance music. • Loved It!"
  },
  {
    "id": "1IOm9ILXiHPEqcPoH7g8t",
    "review": "PngImage4E508E0B350-review-f8f86058-21a6-472b-944f-9b7e6fb320d9",
    "alttext": "The Jazz Influence: Electronic Jazz Compiled by Kevin Yost • 2006 • Various Artists I don't know if you ever listen to modern eclectic jazz, if that's even a thing, but it's great. This is a nice up and downbeat album - again, is that even a thing? But it is, and it's great. • Loved It!"
  },
  {
    "id": "j2h8IpJGRxrlOzDqWdMR-",
    "review": "PngImage46DeB327Ad0-review-d3aa0499-9828-41ed-afb4-60519952162d",
    "alttext": "Acacia / Haru Yo, Koi (Nina Kraviz Remix) - Single • 2024 • Yumi Matsutoya I have a weird relationship with J-Pop. I spent a good chunk of my childhood desperately trying to escape it. Now I appreciate some of it. Yumi Matsutoya is right on the edge of liking and only wanting in small doses. 😄 • Liked It"
  },
  {
    "id": "449NBMCdH2lQeUOezsiK6",
    "review": "PngImage462E9711B50-review-1fe936eb-01d6-4864-841d-d2cdb1ad409a",
    "alttext": "Trilogy (The Best Of) • 2015 • Bitter:Sweet I don't even know what genre this is, but I like it. Bitter:Sweet is featured on \"Martini Bar Essentials\" on Apple Music, so consider that. But I don't care. I like it. • Loved It!"
  },
  {
    "id": "GG0u8LV1wvglsgblZZrPc",
    "review": "PngImage4F98B10BE10-review-00ec7648-bbf1-4acc-8bac-5548564fdfdb",
    "alttext": "Any Day • 2018 • The Sea and Cake A lot of alternative sounds the same, and it's annoying about it. I stumbled across these guys by accident somehow, and they don't strike me that way. A nice summer evening listen with a Honey Ale or a Coffee Stout. • Liked It"
  }
]
